import carImage from "../assets/image/car.png";
import carImage2 from "../assets/image/car2.png";


const AboutUsPage = (props) => {
  const { isMobile } = props;
  return (
    <>
      {isMobile ? (
        <div className="w-full flex flex-col h-full ">
          <div className=" text-center text-blue-400 font-bold text-2xl py-10 mt-[100px] ">
            บริษัท ไฮเปอร์สกายเทค จำกัด
          </div>
          <div className="px-4">
            <h1 className="">
              “ บริษัท ไฮเปอร์สกายเทค จำกัด ได้เริ่มให้บริการ ระบบ IoT Smart
              home ตั้งแต่ ปี พ.ศ. 2560 ต่อมา ในปี 2561
              ได้เริ่มขยายบริการไปยังระบบบริหารจัดการพลังงานในอาคาร
              บริการปรับปรุงระบบไฟฟ้าในอาคารในปัจจุบันการใช้รถยนต์
              พลังงานไฟฟ้าได้มีการเติบโตอย่างต่อเนื่อง ในปี 2564
              บริษัทได้ดำเนินธุรกิจพัฒนาแพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้า
              ให้กับองค์กร โรงแรม อาคาร ภายใต้แบรนด์ Friendly Charge ”
            </h1>
            <h2 className="text-[#C2B299] font-bold text-2xl mt-5">
              เกี่ยวกับ
            </h2>
            <h2 className="text-[#C2B299] font-bold text-2xl mb-5">
              บริษัทไฮเปอร์สกายเทค จำกัด
            </h2>
            <p>
              ธุรกิจของบริษัท ไฮเปอร์สกายเทค ในปี 2564 บริษัทได้ดำเนิน
              ธุรกิจพัฒนาแพลตฟอร์มสำหรับชาร์จ รถยนต์ไฟฟ้า ให้กับองค์กร โรงแรม
              อาคาร ภายใต้แบรนด์ Friendly Charge ที่เน้้นการใช้งาน ที่ง่าย โดย
              ไม่ต้องโหลด APP โดยได้รับการสนับสนุนจาก องค์การนวัตกรรมแห่งชาติ
              (องค์การมหาชน)
            </p>
          </div>
          <div>
            <div className="px-4">
              <p className="text-[#C2B299] font-bold text-2xl my-10">Vision</p>
              <p>
                บริษัท ไฮเปอร์สกายเทค จำกัด มุ่งมั่นก้าวสู่ความเป็น “ผู้นำด้าน
                พัฒนาแพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้าให้กับองค์กร”
                มีวิสัยทัศน์จะเป็นบริษัทอันดับ 1 ของไทยที่ให้บริการระบบดูแลระบบ
                ชาร์จรถยนต์ไฟฟ้าให้กับองค์กร และติดตั้งเครื่องชาร์จให้กับบ้าน
                ที่อยู่อาศัย โดยใช้เครื่องชาร์จและระบบไฟฟ้าที่มีคุณภาพ มาตรฐาน
                มอก./IEC พร้อมส่งมอบบริการชั้นเลิศและสินค้าที่มีคุณภาพระดับโลก
                ในราคาที่จับต้องได้และคุ้มค่าการลงทุน อีกทั้งยังให้คำแนะนำ
                และเป็นที่ปรึกษาอย่างจริงใจ
                เพื่อความประทับใจของผู้ใช้รถยนต์ไฟฟ้า ทั่วประเทศไทยประเทศไทย
              </p>
            </div>
            <img src={carImage} className="h-[240px] py-4 w-full" alt="car" />
          </div>
          <div className=" px-4">
            <div>
              <p className="text-[#C2B299] font-bold text-2xl my-4">Mission</p>
            </div>
            <div className="flex flex-col">
              <p>
                1. ตอบสนองความต้องการของลูกค้าองค์กรด้วยการให้บริการ
                แพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้า
                และติดตั้งเครื่องชาร์จพร้อมระบบไฟฟ้า
              </p>
              <p>
                2. พัฒนาระบบซอร์ฟแวร์ของแพลตฟอร์มอย่างสม่ำเสมอเพื่อ
                เพิ่มประสิทธิภาพและความรวดเร็วในการทำงาน พร้อมทีมบริการ 24 ชม.
              </p>
              <p>
                3. ให้บริการเพื่อยกระดับมาตรฐานความปลอดภัยของผู้ใช้รถยนต์
                ไฟฟ้าในบ้าน 
              </p>
              <p>
                4. มุ่งมั่นที่จะพัฒนาบุคลากรสู่ความเป็นเลิศ
                เพื่อส่งมอบงานที่มีคุณภาพ บริการอย่างเป็นมืออาชีพ
                และใส่ใจดูแลลูกค้าอย่างใกล้ชิด
              </p>
            </div>
          </div>
          <img src={carImage2} className="h-[240px] py-4 w-full" alt="car" />
          <div className="flex flex-col px-4">
            <p className="text-[#C2B299] font-bold text-2xl my-5">
              นโยบายคุณภาพ
            </p>
            <p>
              ส่งมอบสินค้าและบริการที่มีคุณภาพ
              มีความปลอดภัยและยั่งยืนใส่ใจลูกค้า พัฒนาบุคลากร
              ให้ครบวงจรด้านการชาร์จรถยนต์ไฟฟ้าที่มีคุณภาพ 
            </p>
          </div>
        </div>
      ) : (
        <div className="flex flex-col justify-center items-center h-full mt-[200px] ">
          <div className=" text-center text-blue-400 font-bold text-6xl ">
            บริษัท ไฮเปอร์สกายเทค จำกัด
          </div>
          {/* <MapWithMarker /> */}
          <h1 className="w-[1170px] mt-7">
            “ บริษัท ไฮเปอร์สกายเทค จำกัด ได้เริ่มให้บริการ ระบบ IoT Smart home
            ตั้งแต่ ปี พ.ศ. 2560 ต่อมา ในปี 2561
            ได้เริ่มขยายบริการไปยังระบบบริหารจัดการพลังงานในอาคาร
            บริการปรับปรุงระบบไฟฟ้าในอาคารในปัจจุบันการใช้รถยนต์
            พลังงานไฟฟ้าได้มีการเติบโตอย่างต่อเนื่อง ในปี 2564
            บริษัทได้ดำเนินธุรกิจพัฒนาแพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้า
            ให้กับองค์กร โรงแรม อาคาร ภายใต้แบรนด์ Friendly Charge ”
          </h1>
          <div className="grid grid-cols-2 w-[1170px] mt-[60px] ">
            <div>
              <h2 className="text-[#C2B299] font-bold text-4xl">เกี่ยวกับ</h2>
              <h2 className="text-[#C2B299] font-bold text-4xl my-4">
                บริษัทไฮเปอร์สกายเทค จำกัด
              </h2>
              <p>
                ธุรกิจของบริษัท ไฮเปอร์สกายเทค ในปี 2564 บริษัทได้ดำเนิน
                ธุรกิจพัฒนาแพลตฟอร์มสำหรับชาร์จ รถยนต์ไฟฟ้า ให้กับองค์กร โรงแรม
                อาคาร ภายใต้แบรนด์ Friendly Charge ที่เน้้นการใช้งาน ที่ง่าย โดย
                ไม่ต้องโหลด APP โดยได้รับการสนับสนุนจาก องค์การนวัตกรรมแห่งชาติ
                (องค์การมหาชน)
              </p>
            </div>
            <div className="flex flex-col justify-end ">
              ทางบริษัทยังมีบริการให้คำปรึกษา/จำหน่าย/ติดตั้งเครื่องชาร์จ
              รถยนต์ไฟฟ้าให้กับลูกค้าบ้านที่อยู่อาศัย ภายใต้แบรนด์ Dynamo-EV
              บุคคลากรของบริษัทฯ ได้ผ่านการอบรม และได้รับการรับรองจาก
              ทั้งในและต่างประเทศ อีกทั้งได้คำนึงถึงคุณภาพของสินค้า เป็นหลัก
              จึงจำหน่ายสินค้าที่ได้รับมาตรฐานระดับยุโรป และระดับโลก
              มีความน่าเชื่อถือและมีความมั่นคง
            </div>
          </div>
          <div className="bg-[#E9E9E9] flex w-full mt-[30px] justify-center ">
            <div className="grid grid-cols-2 w-[1170px] gap-5 my-[60px]">
              <div>
                <p className="text-[#C2B299] font-bold text-4xl my-4">Vision</p>
                <p>
                  บริษัท ไฮเปอร์สกายเทค จำกัด มุ่งมั่นก้าวสู่ความเป็น “ผู้นำด้าน
                  พัฒนาแพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้าให้กับองค์กร”
                  มีวิสัยทัศน์จะเป็นบริษัทอันดับ 1
                  ของไทยที่ให้บริการระบบดูแลระบบ ชาร์จรถยนต์ไฟฟ้าให้กับองค์กร
                  และติดตั้งเครื่องชาร์จให้กับบ้าน ที่อยู่อาศัย
                  โดยใช้เครื่องชาร์จและระบบไฟฟ้าที่มีคุณภาพ มาตรฐาน มอก./IEC
                  พร้อมส่งมอบบริการชั้นเลิศและสินค้าที่มีคุณภาพระดับโลก
                  ในราคาที่จับต้องได้และคุ้มค่าการลงทุน อีกทั้งยังให้คำแนะนำ
                  และเป็นที่ปรึกษาอย่างจริงใจ
                  เพื่อความประทับใจของผู้ใช้รถยนต์ไฟฟ้า ทั่วประเทศไทยประเทศไทย
                </p>
              </div>
              <div className="flex flex-col justify-end ">
                <img src={carImage} className="h-[370px] w-[570px]" alt="car" />
              </div>
            </div>
          </div>
          <div className="grid grid-cols-2 w-[1170px] mt-[60px] ">
            <div>
              <p className="text-[#C2B299] font-bold text-4xl my-4">Mission</p>
            </div>
            <div className="flex flex-col justify-end ">
              <p>
                1. ตอบสนองความต้องการของลูกค้าองค์กรด้วยการให้บริการ
                แพลตฟอร์มสำหรับชาร์จรถยนต์ไฟฟ้า
                และติดตั้งเครื่องชาร์จพร้อมระบบไฟฟ้า
              </p>
              <p>
                2. พัฒนาระบบซอร์ฟแวร์ของแพลตฟอร์มอย่างสม่ำเสมอเพื่อ
                เพิ่มประสิทธิภาพและความรวดเร็วในการทำงาน พร้อมทีมบริการ 24 ชม.
              </p>
              <p>
                3. ให้บริการเพื่อยกระดับมาตรฐานความปลอดภัยของผู้ใช้รถยนต์
                ไฟฟ้าในบ้าน 
              </p>
              <p>
                4. มุ่งมั่นที่จะพัฒนาบุคลากรสู่ความเป็นเลิศ
                เพื่อส่งมอบงานที่มีคุณภาพ บริการอย่างเป็นมืออาชีพ
                และใส่ใจดูแลลูกค้าอย่างใกล้ชิด
              </p>
            </div>
          </div>
          <div className="bg-[#E9E9E9] flex w-full mt-[30px] justify-center ">
            <div className="grid grid-cols-2  gap-5 w-[1170px]">
              <div className="flex flex-col ">
                <img src={carImage2} className="h-full w-full" alt="car" />
              </div>
              <div className="flex flex-col justify-center items-center">
                <p className="text-[#C2B299] font-bold text-4xl my-4">
                  นโยบายคุณภาพ
                </p>
                <p>
                  ส่งมอบสินค้าและบริการที่มีคุณภาพ
                  มีความปลอดภัยและยั่งยืนใส่ใจลูกค้า พัฒนาบุคลากร
                  ให้ครบวงจรด้านการชาร์จรถยนต์ไฟฟ้าที่มีคุณภาพ 
                </p>
              </div>
            </div>
          </div>
        </div>
      )}
    </>
  );
};

export default AboutUsPage;
